---
title: StructuralConnectionSettings
classe: Autodesk.Revit.DB.Structure.StructuralConnectionSettings
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# StructuralConnectionSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IncludeWarningControls { get; set; }` | `structuralConnectionSettings.IncludeWarningControls` | Boolean |
| `StructuralConnectionSettings GetStructuralConnectionSettings(Document)` | `StructuralConnectionSettings.GetStructuralConnectionSettings(document)` | StructuralConnectionSettings |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```